Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_8 (Conv2D)            (None, 20, 20, 32)        832       
_________________________________________________________________
activation_16 (Activation)   (None, 20, 20, 32)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 16, 16, 32)        25632     
_________________________________________________________________
activation_17 (Activation)   (None, 16, 16, 32)        0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 8, 8, 32)          0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 2048)              0         
_________________________________________________________________
dense_8 (Dense)              (None, 32)                65568     
_________________________________________________________________
activation_18 (Activation)   (None, 32)                0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_9 (Dense)              (None, 8)                 264       
_________________________________________________________________
activation_19 (Activation)   (None, 8)                 0         
=================================================================
Total params: 92,296
Trainable params: 92,296
Non-trainable params: 0
_________________________________________________________________
Test accuracy: 0.6108436584472656, Mean Val acc: 87.51772999763489, Test precision: 0.6751269102096558, Mean Val precision: 0.9425121188163758, Test recall: 0.5054471492767334, Mean Val recall: 0.798241126537323, 