Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_4 (Conv2D)            (None, 20, 20, 32)        832       
_________________________________________________________________
activation_8 (Activation)    (None, 20, 20, 32)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 16, 16, 32)        25632     
_________________________________________________________________
activation_9 (Activation)    (None, 16, 16, 32)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 8, 8, 32)          0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 2048)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 32)                65568     
_________________________________________________________________
activation_10 (Activation)   (None, 32)                0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 8)                 264       
_________________________________________________________________
activation_11 (Activation)   (None, 8)                 0         
=================================================================
Total params: 92,296
Trainable params: 92,296
Non-trainable params: 0
_________________________________________________________________
Test accuracy: 0.3448702096939087, Mean Val acc: 58.382606506347656, Test precision: 0.5219683647155762, Mean Val precision: 0.6442286769549052, Test recall: 0.18355995416641235, Mean Val recall: 0.3205905167075495, 