Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_8 (Conv2D)            (None, 28, 28, 32)        832       
_________________________________________________________________
activation_16 (Activation)   (None, 28, 28, 32)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 24, 24, 32)        25632     
_________________________________________________________________
activation_17 (Activation)   (None, 24, 24, 32)        0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 12, 12, 32)        0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 12, 12, 32)        0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 4608)              0         
_________________________________________________________________
dense_8 (Dense)              (None, 32)                147488    
_________________________________________________________________
activation_18 (Activation)   (None, 32)                0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_9 (Dense)              (None, 8)                 264       
_________________________________________________________________
activation_19 (Activation)   (None, 8)                 0         
=================================================================
Total params: 174,216
Trainable params: 174,216
Non-trainable params: 0
_________________________________________________________________
Test accuracy: 0.6383329033851624, Mean Val acc: 88.79999995231628, Test precision: 0.6915227770805359, Mean Val precision: 0.9415144920349121, Test recall: 0.5580187439918518, Mean Val recall: 0.8284822702407837, 