Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_8 (Conv2D)            (None, 22, 22, 32)        320       
_________________________________________________________________
activation_16 (Activation)   (None, 22, 22, 32)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 20, 20, 32)        9248      
_________________________________________________________________
activation_17 (Activation)   (None, 20, 20, 32)        0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 10, 10, 32)        0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 10, 10, 32)        0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 3200)              0         
_________________________________________________________________
dense_8 (Dense)              (None, 32)                102432    
_________________________________________________________________
activation_18 (Activation)   (None, 32)                0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_9 (Dense)              (None, 8)                 264       
_________________________________________________________________
activation_19 (Activation)   (None, 8)                 0         
=================================================================
Total params: 112,264
Trainable params: 112,264
Non-trainable params: 0
_________________________________________________________________
Test accuracy: 0.593362033367157, Mean Val acc: 87.2624123096466, Test precision: 0.6619822382926941, Mean Val precision: 0.9443730115890503, Test recall: 0.45350900292396545, Mean Val recall: 0.7960851073265076, 