Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_8 (Conv2D)            (None, 44, 44, 32)        832       
_________________________________________________________________
activation_16 (Activation)   (None, 44, 44, 32)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 40, 40, 32)        25632     
_________________________________________________________________
activation_17 (Activation)   (None, 40, 40, 32)        0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 20, 20, 32)        0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 20, 20, 32)        0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 12800)             0         
_________________________________________________________________
dense_8 (Dense)              (None, 32)                409632    
_________________________________________________________________
activation_18 (Activation)   (None, 32)                0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_9 (Dense)              (None, 8)                 264       
_________________________________________________________________
activation_19 (Activation)   (None, 8)                 0         
=================================================================
Total params: 436,360
Trainable params: 436,360
Non-trainable params: 0
_________________________________________________________________
Test accuracy: 0.6593615412712097, Mean Val acc: 88.7489366531372, Test precision: 0.7226549983024597, Mean Val precision: 0.9530721187591553, Test recall: 0.5640993118286133, Mean Val recall: 0.8057872295379639, 